# coding: utf-8
import random


def random_full_name():
    last = ('百合', '吹雪', '彤依', '辛舒', '匀琰', '紫妹', '宇洪', '冰佩', '霄杰', '济玉', '翔影', '纾娇', '润岚', '函泽', '硕荧', '名梓', '妮锦', '晶浩', '婧匀', '尤霄', '纤纾', '璐翔', '淑济', '不败', '求败', '淇月', '书婷', '雨慧', '若愚', '小雨', '小雨', '雨岚', '小红', '小明', '晗瑜', '家腾', '贤春')
    first = ('赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '罗', '唐', '西门', '即墨', '上官', '欧阳', '端木', '公羊', '公孙', '第五', '百里', '南宫', '女娲', '濮阳', '司徒', '司马', '司空', '夏侯', '轩辕', '诸葛', '贺兰', '纳兰', '独孤')
    return "{}{}".format(random.choice(first), random.choice(last))